app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "deadline", "description", "row_order", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-26 03:37:54.453387"], ["deadline", "2014-10-26 00:00:00.000000"], ["description", "123"], ["row_order", 0], ["updated_at", "2014-10-26 03:37:54.453387"]]
---
  def create
    @task = Task.create(task_params)

UPDATE "tasks" SET "deadline" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["deadline", "2014-10-22 03:03:00.000000"], ["updated_at", "2014-10-26 01:03:44.199512"]]
---
  def update
    @task.update_attributes(task_params)

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "tasks" SET row_order = row_order - 1 WHERE "tasks"."id" IN (SELECT "tasks"."id" FROM "tasks"  WHERE ("tasks"."id" != 31) AND ("tasks"."row_order" <= 8388607)  ORDER BY "tasks"."row_order" ASC)
---
  def update_row_order
    @task = Task.find(task_params[:task_id])
    @task.row_order_position = task_params[:row_order_position]
    @task.save

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_tasks
      @task = Task.find(params[:id])